fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Заполнить табличную часть обработки в фоне.
Процедура ВКМ_ЗаполнитьТабличнуюЧастьВФоне(ПараметрыВыполнения, АдресРезультата) Экспорт
	
	Период = ПараметрыВыполнения.Период;
	ДанныеТабличнойЧасти = ВКМ_ПолучитьДанныеДоговоровЗаПериод(Период);
	
	ПоместитьВоВременноеХранилище(ДанныеТабличнойЧасти, АдресРезультата);
	
КонецПроцедуры
// Создать и провести реализации в фоне.

Процедура ВКМ_СоздатьРеализацииВФоне(ПараметрыВыполнения, АдресРезультата) Экспорт
	
	Период = ПараметрыВыполнения.Период;
	ТаблицаДоговоров = ПараметрыВыполнения.Договоры;
	
	ДатаДокумента = КонецМесяца(Период.ДатаОкончания);
	ОшибкиСоздания = Новый Массив;
	
	Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
		
		// Уже есть реализация за месяц — пропускаем.
		Если ЗначениеЗаполнено(СтрокаДоговора.ВКМ_Реализация) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаДоговора.ВКМ_Договор) Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатСоздания = ВКМ_СоздатьИПровестиРеализацию(
			СтрокаДоговора.ВКМ_Договор,
			ДатаДокумента);
		
		Если ЗначениеЗаполнено(РезультатСоздания.Реализация) Тогда
			СтрокаДоговора.ВКМ_Реализация = РезультатСоздания.Реализация;
		ИначеЕсли ЗначениеЗаполнено(РезультатСоздания.ТекстОшибки) Тогда
			ОшибкиСоздания.Добавить(РезультатСоздания.ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Договоры", ТаблицаДоговоров);
	Результат.Вставить("ОшибкиСоздания", ОшибкиСоздания);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции
// Список абонентских договоров и уже созданных реализаций за месяц.
Функция ВКМ_ПолучитьДанныеДоговоровЗаПериод(Период)

	НачалоМесяца = НачалоМесяца(Период.ДатаНачала);
	КонецМесяца  = КонецМесяца(Период.ДатаОкончания);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК ВКМ_Договор,
	|	ЕСТЬNULL(Реализации.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК ВКМ_Реализация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Реализация.Договор КАК Договор,
	|			МАКСИМУМ(Реализация.Ссылка) КАК Ссылка
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг КАК Реализация
	|		ГДЕ
	|			Реализация.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|			И НЕ Реализация.ПометкаУдаления
	|		СГРУППИРОВАТЬ ПО
	|			Реализация.Договор) КАК Реализации
	|		ПО Договоры.Ссылка = Реализации.Договор
	|ГДЕ
	|	Договоры.ВидДоговора = &ВидДоговора
	|	И НЕ Договоры.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВКМ_Договор";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Создать и провести одну реализацию. Возвращает структуру с полями Реализация и ТекстОшибки.
Функция ВКМ_СоздатьИПровестиРеализацию(Договор, ДатаДокумента)
	
	Результат = Новый Структура;
	Результат.Вставить("Реализация", Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	Результат.Вставить("ТекстОшибки", "");
	
	Попытка
		
		ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокументОбъект.Дата = ДатаДокумента;
		
		ДокументОбъект.Заполнить(Договор);
		ДокументОбъект.ВыполнитьАвтозаполнение();
		
		Если ДокументОбъект.Услуги.Количество() = 0
			И ДокументОбъект.Товары.Количество() = 0 Тогда
			
			Результат.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'По договору %1 нечего реализовать за %2.'"),
				Договор,
				Формат(ДатаДокумента, "ДЛФ=D"));
			Возврат Результат;
			
		КонецЕсли;
		
		Если Не ДокументОбъект.ПроверитьЗаполнение() Тогда
			Результат.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Не заполнены обязательные реквизиты реализации по договору %1.'"),
				Договор);
			Возврат Результат;
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Результат.Реализация = ДокументОбъект.Ссылка;
		
	Исключение
		
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка создания реализации по договору %1: %2'"),
			Договор,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
// Проверка — есть ли уже реализация за месяц.

#КонецОбласти
#КонецЕсли
